import React from 'react';
import { motion } from 'framer-motion';
import Vision from '../../src/assets/vision.png';
import Nusery from '../../src/assets/Nusery.png';
import { useTranslation } from 'react-i18next';

const OurVision = () => {
  const { t, i18n } = useTranslation();
  return (
    <>
      <div className='min-h-screen bg-yellow-100 px-8 py-12 text-right sm:px-6 md:px-10 lg:px-16
     text-black leading-relaxed mt-10'>
        <h1 className='text-3xl font-bold text-center'>رؤية هابي لاند</h1>
        <span className='bg-yellow-500 w-20 h-1 rounded-full block mt-3 mb-20 mx-auto '></span>

        <div className="flex justify-center items-center -mt-10 px-4 sm:px-6 md:px-8 lg:px-10">
          <img
            src={Vision}
            alt="Nursery"
              className="h-auto object-cover
               max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl"
          />
        </div>


        <div>
          <ul className="list-disc list-inside space-y-4 text-right text-lg text-black" dir="rtl">
            <li>التوسع الجغرافي ويتمثل في استكمال افتتاح عدد 30 فرع في المحافظات الست في دولة الكويت يبلغ العدد الحالي 13 فرع على أن يتم استكمال عدد 16 فرع بنهاية الخطة.</li>
            <li>. تنمية الإيرادات السنوية موزعة كالتالي: رسوم دراسية ورسوم النادي الصيفي وتمثل تقريبا 80% - أما 20% الباقية فهي موزعة كالتالي: الكتاب السنوي - الحفل الختامي - بيع الملابس بيع صناديق الهدايا والتذكارات - المسائي مع إمكانية إضافة فرص وخلق أحداث ومناسبات تسويقية وإعلامية).</li>
            <li>. توظيف التكنولوجيا في رفع جودة الخدمة وترشيد الانفاق متمثلة في استخدام الرجل الآلي (الروبوت) وأدوات الذكاء الصناعي المختلفة. يمكن اجراء تجربة في عدد 3 أفرع لمدة أسبوع وتقييم التجربة وذلك للنظر في مدى جدواها ومن ثم تعميمها).</li>
            <li>بناء منظومة علاقات محلية وخارجية مع المؤسسات والشركات المثيلة والعاملة في الميدان (بروتوكولات تعاون - مذكرات تفاهم - عقود عمل - تدريب - استشارات وذلك في كل دول مجلس التعاون الخليجي والعالم العربي.</li>
            <li> بناء فريق عمل قادر على تحقيق أهداف وتطلعات الشركة ومتمكن من إدارتها وفق معطيات العصر. وإبعادها عن المعوقات والمزالق الناتجة عن الخلل وسوء الإدارة. </li>
            <li> الحضور العالمي من خلال العمل على المشاركة في المناسبات الثقافية الخاصة بالمنظمة الدولية والتي تمس تخصص الشركة مع النظر في امكانية عقد اتفاقات وبرتوكولات تعاون مع المنظمة الدولية والوكالات التابعة لها.   </li>
            <li>. فتح قنوات جديدة في الأعمال والاستثمار وذلك بغرض تعدد مصادر الدخل وتنويعها وتنميتها وقد تأخذ شكل تأسيس شركات خدمات لوجستية تقوم بتقديم الخدمات الضرورية للشركات الزميلة في المقام الأول وباقي القطاع التجاري في المقام الثاني. وقد تأخذ شكل مشروعات تشغيلية ضمن خطة وحدات العمل الإدارات والأقسام أو توظيف المناسبات (occasions) وخلق الأحداث (events)
              .لزيادة الإيرادات وتعظيمها </li>
          </ul>

        </div>

        {/* MyNusery */}

        <div>
          <h1 className='text-3xl font-bold text-center mt-15'>رؤية ماي نيرسري‎</h1>
          <span className='bg-yellow-500 w-20 h-1 rounded-full block mt-3 mx-auto '></span>

          {/* images */}

          <div className="flex justify-center items-center -mt-10">
            <img src={Nusery}   
            className="h-auto object-cover
               max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl" alt="Nursery" />
          </div>


          <div className='-mt-10'>
            <h2 className='text-2xl font-bold mb-5 text-yellow-700 ml-5'>في إطار التدريب :</h2>

            <ul className='text-black list-disc list-inside space-y-4 text-lg '>
              <li>جهیز خطة تدريب متكاملة تغطي جوانب الاهتمامات المختلفة للأفراد والمؤسسات مستخدمة لذلك الغرض جميع الأدوات الفنية التي تساعد على تحقيق هذا الهدف، وتفاصيلها كالتالي:</li>
              <li>تنمية الإيرادات السنوية موزعة كالتالي: التدريب والاستشارات بكل أقسامه والتعليم بكل أقسامه . </li>
              <li>في مجال التدريب الحضوري الجماهيري تقديم باقة متنوعة من البرامج التي تعمل على تزويد المشاركين بالمهارات والفنون والسلوك والفكر الذي يسعى إلى بلورة شخصية متوازنة قادرة على التعامل مع معطيات الحياة بكل اقتدار واحترافية. يبلغ عدد البرامج المستهدف 70 برنامج موزعين بواقع عدد (2) برنامج في الأسبوع الواحد بتخصصات متنوعة تغطي مجالات العمل المختلفة مع إمكانية الزيادة إذا تطلب ذلك</li>
              <li>التدريب عن بعد التدريب الجماهيري من خلال وسائل التواصل والنقل المعمول فيها لهذا الغرض. بواقع 80 برنامج سنويا. وذلك في مجالات العلم والمعرفة المختلفة</li>
              <li>. خوض غمار التدريب الحكومي الدورات التعاقدية من خلال تقديم العروض لديوان الخدمة المدنية والمؤسسات الحكومية والأهلية والتجارية المختلفة والذي يأخذ الاشكال التالية: عروض مقدمة لخطط الديوان التدريبية - عروض مقدمة لخطط المؤسسات الحكومية التدريبية. (عدد البرامج التعاقدية ترتبط بطريقة توزيع البرامج التدريبية على شركات التدريب). بالإضافة إلى برامج نقترحها لديوان الخدمة المدنية وكذلك مؤسسات الحكومة المختلفة والتي يمكن أن تدخل ضمن نطاق التدريب الجماهيري.
              </li>
              <li>التدريب الذي يأخذ شكل السياحة والترفيه وتتداخل معه جرعة من التدريب غير التقليدي ترتيب رحلات خارجية عائلية وفردية في مواسم العطلات) تجمع ما بين المتعة والترفيه والفائدة العلمية التربوية إلى بلاد ومناطق غير تقليدية وفق برنامج يتم اعداده مسبقا</li>
              <li>. التدريب الأسري والذي يمكن تصميمه لفائدة أسرة أو مجموعة معينة بشكل خاص. وعادة هذا النوع من التدريب يتناول كيفية تحسين العلاقات الأسرية - تربية الأبناء - العلاقات الزوجية. أسس بناء الأسرة - التغيرات النفسية والسلوكية لدى أفراد هذه الأسرة. </li>
              <li>التدريب الذي يرتبط بتأسيس المشروعات الصغيرة والمنزلية متناهية الصغر) وهذا اتجاه يتنامى يوماً بعد يوم. بل هو في الحقيقة المجال الذي انطلقت منه كبرى الأعمال والمشروعات الكبيرة بل العالمية المنتشرة في شتى بقاع الأرض. فالمشروعات الكبيرة بدأت كمشروعات صغيرة وقد تكون منزلية. ثم بعدها مرت بمراحل ومحطات فشل وسقوط ثم نجاح وانتشار. وهذا ما نشهده اليوم في السوق المحلي على مستوى المشروعات الصغيرة. وكذلك ما تشهده ساحة منصات التواصل الاجتماعي من أفكار ومشروعات منزلية فردية وأسرية وجماعية. تأسيساً على كل هذا تقوم هذه الوحدة بتقديم التوجيه والإرشاد اللازم حول الكيفية التي يجب التعامل من خلالها عند الدخول في ساحة العمل التجاري من بوابة المشروعات الصغيرة أو المنزلية</li>
              <li>التدريب الذي يقود للحصول على مؤهل مهني في المجالات المتخصصة كالمحاسبة والتدقيق المالي والتخصصات المرتبطة بالجوانب التقنية كالدعم الفني وصيانة الأجهزة والمعدات والشبكات ومهارات إدارة المكاتب ومهارات التسويق الإلكتروني والأمن السبراني ... إلخ . </li>
              <li>الاتجاه نحو تدريب الصغار وذلك في كل ما يرتبط بموضوعات التراث وثقافة المجتمع مثل : أسس الضيافة العربية - التعامل مع البيئة البرية - التعامل مع البيئة البحرية - الألعاب القديمة ... إلخ</li>
            </ul>
          </div>

          <div className='mt-5 '>
            <h2 className='text-2xl font-bold mb-5 text-yellow-700 ml-5'>في إطار الاستشارات .</h2>

            <ul className='list-disc list-inside space-y-4 text-lg '>
              <li> أما فيما يتعلق في مجال الاستشارات فالرؤية الاستراتيجية تتجه ضمن التالي: </li>
              <li>مركز التدخل المبكر وهو مركز متخصص يقوم بتقديم الاستشارات والدعم والتأهيل للاحتياجات الخاصة ومن في حكمهم. حيث تم و تجهيز عيادة وجهاز فني متخصص لهذا الغرض</li>
              <li>الدعم الاسري وذلك بغرض التعامل مع كل ما يتعلق في منظومة العلاقات الأسرية وتربية الأبناء بناء والتعامل مع سلوكيات المراهقين وأنماط شخصياتهم ... إلخ</li>
              <li>استشارات مهارات القيادة وإدارة الأعمال وما يرتبط فيها من مهارات ومعارف وقيم تساعد المبادر أو رجل الأعمال على تحسين مشروعاته وأعماله. . استشارات تتعلق في مجالات العمل المختلفة مثل: الاستثمار في البورصة - الذهب - العملات - دراسات الجدوى - دراسات الإدارة المختلفة وما يرتبط فيها من فروع ... إلخ</li>
            </ul>

          </div>




        </div>

      </div>
    </>
  );
};

export default OurVision;
