import React from 'react';
import { motion } from 'framer-motion';
import Vision from '../../src/assets/vision.png';
import Nusery from '../../src/assets/Nusery.png';
import { useTranslation } from 'react-i18next';
import Perp from '../../src/assets/perp.png'
import Nuser from '../../src/assets/Nuser.png'

const OurVision = () => {
  const { t, i18n } = useTranslation();
  return (
    <>
      <div className='min-h-screen bg-yellow-100 px-8 py-12 text-right sm:px-6 md:px-10 lg:px-16
     text-black leading-relaxed mt-15'>
        <h1 className='text-4xl font-bold text-center'>رؤية هابي لاند</h1>
        <span className='bg-yellow-500 w-20 h-1 rounded-full block mt-4 mb-15 mx-auto '></span>

        <div className="flex justify-center items-center -mt-10 px-4 sm:px-6 md:px-8 lg:px-10">
          <img
            src={Vision}
            alt="Nursery"
            className="h-auto object-cover
               max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl"
          />
        </div>


        <div>
          <ul className="list-disc list-inside space-y-4 text-right text-lg text-black" dir="rtl">
            <li>التوسع الجغرافي ويتمثل في استكمال افتتاح عدد 30 فرع في المحافظات الست في دولة الكويت يبلغ العدد الحالي 13 فرع على أن يتم استكمال عدد 16 فرع بنهاية الخطة.</li>
            <li>. تنمية الإيرادات السنوية موزعة كالتالي: رسوم دراسية ورسوم النادي الصيفي وتمثل تقريبا 80% - أما 20% الباقية فهي موزعة كالتالي: الكتاب السنوي - الحفل الختامي - بيع الملابس بيع صناديق الهدايا والتذكارات - المسائي مع إمكانية إضافة فرص وخلق أحداث ومناسبات تسويقية وإعلامية).</li>
            <li>. توظيف التكنولوجيا في رفع جودة الخدمة وترشيد الانفاق متمثلة في استخدام الرجل الآلي (الروبوت) وأدوات الذكاء الصناعي المختلفة. يمكن اجراء تجربة في عدد 3 أفرع لمدة أسبوع وتقييم التجربة وذلك للنظر في مدى جدواها ومن ثم تعميمها).</li>
            <li>بناء منظومة علاقات محلية وخارجية مع المؤسسات والشركات المثيلة والعاملة في الميدان (بروتوكولات تعاون - مذكرات تفاهم - عقود عمل - تدريب - استشارات وذلك في كل دول مجلس التعاون الخليجي والعالم العربي.</li>
            <li> بناء فريق عمل قادر على تحقيق أهداف وتطلعات الشركة ومتمكن من إدارتها وفق معطيات العصر. وإبعادها عن المعوقات والمزالق الناتجة عن الخلل وسوء الإدارة. </li>
            <li> الحضور العالمي من خلال العمل على المشاركة في المناسبات الثقافية الخاصة بالمنظمة الدولية والتي تمس تخصص الشركة مع النظر في امكانية عقد اتفاقات وبرتوكولات تعاون مع المنظمة الدولية والوكالات التابعة لها.   </li>
            <li>. فتح قنوات جديدة في الأعمال والاستثمار وذلك بغرض تعدد مصادر الدخل وتنويعها وتنميتها وقد تأخذ شكل تأسيس شركات خدمات لوجستية تقوم بتقديم الخدمات الضرورية للشركات الزميلة في المقام الأول وباقي القطاع التجاري في المقام الثاني. وقد تأخذ شكل مشروعات تشغيلية ضمن خطة وحدات العمل الإدارات والأقسام أو توظيف المناسبات (occasions) وخلق الأحداث (events)
              .لزيادة الإيرادات وتعظيمها </li>
          </ul>

        </div>

        {/* MyNusery */}

        <div>
          <h1 className='text-4xl font-bold text-center mt-15'>رؤية ماي نيرسري‎</h1>
          <span className='bg-yellow-500 w-20 h-1 rounded-full block mt-3 mx-auto '></span>

          {/* images */}

          <div className="flex justify-center items-center -mt-10">
            <img src={Nusery}
              className="h-auto object-cover
               max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl" alt="Nursery" />
          </div>


          <div className='-mt-10'>
            <h2 className='text-2xl font-bold mb-5 text-yellow-700 ml-5'>في إطار التدريب :</h2>

            <ul className='text-black list-disc list-inside space-y-4 text-lg '>
              <li>تجهیز خطة تدريب متكاملة تغطي جوانب الاهتمامات المختلفة للأفراد والمؤسسات مستخدمة لذلك الغرض جميع الأدوات الفنية التي تساعد على تحقيق هذا الهدف، وتفاصيلها كالتالي:</li>
              <li>تنمية الإيرادات السنوية موزعة كالتالي: التدريب والاستشارات بكل أقسامه والتعليم بكل أقسامه . </li>
              <li>في مجال التدريب الحضوري الجماهيري تقديم باقة متنوعة من البرامج التي تعمل على تزويد المشاركين بالمهارات والفنون والسلوك والفكر الذي يسعى إلى بلورة شخصية متوازنة قادرة على التعامل مع معطيات الحياة بكل اقتدار واحترافية. يبلغ عدد البرامج المستهدف 70 برنامج موزعين بواقع عدد (2) برنامج في الأسبوع الواحد بتخصصات متنوعة تغطي مجالات العمل المختلفة مع إمكانية الزيادة إذا تطلب ذلك</li>
              <li>التدريب عن بعد التدريب الجماهيري من خلال وسائل التواصل والنقل المعمول فيها لهذا الغرض. بواقع 80 برنامج سنويا. وذلك في مجالات العلم والمعرفة المختلفة</li>
              <li>. خوض غمار التدريب الحكومي الدورات التعاقدية من خلال تقديم العروض لديوان الخدمة المدنية والمؤسسات الحكومية والأهلية والتجارية المختلفة والذي يأخذ الاشكال التالية: عروض مقدمة لخطط الديوان التدريبية - عروض مقدمة لخطط المؤسسات الحكومية التدريبية. (عدد البرامج التعاقدية ترتبط بطريقة توزيع البرامج التدريبية على شركات التدريب). بالإضافة إلى برامج نقترحها لديوان الخدمة المدنية وكذلك مؤسسات الحكومة المختلفة والتي يمكن أن تدخل ضمن نطاق التدريب الجماهيري.
              </li>
              <li>التدريب الذي يأخذ شكل السياحة والترفيه وتتداخل معه جرعة من التدريب غير التقليدي ترتيب رحلات خارجية عائلية وفردية في مواسم العطلات) تجمع ما بين المتعة والترفيه والفائدة العلمية التربوية إلى بلاد ومناطق غير تقليدية وفق برنامج يتم اعداده مسبقا</li>
              <li>. التدريب الأسري والذي يمكن تصميمه لفائدة أسرة أو مجموعة معينة بشكل خاص. وعادة هذا النوع من التدريب يتناول كيفية تحسين العلاقات الأسرية - تربية الأبناء - العلاقات الزوجية. أسس بناء الأسرة - التغيرات النفسية والسلوكية لدى أفراد هذه الأسرة. </li>
              <li>التدريب الذي يرتبط بتأسيس المشروعات الصغيرة والمنزلية متناهية الصغر) وهذا اتجاه يتنامى يوماً بعد يوم. بل هو في الحقيقة المجال الذي انطلقت منه كبرى الأعمال والمشروعات الكبيرة بل العالمية المنتشرة في شتى بقاع الأرض. فالمشروعات الكبيرة بدأت كمشروعات صغيرة وقد تكون منزلية. ثم بعدها مرت بمراحل ومحطات فشل وسقوط ثم نجاح وانتشار. وهذا ما نشهده اليوم في السوق المحلي على مستوى المشروعات الصغيرة. وكذلك ما تشهده ساحة منصات التواصل الاجتماعي من أفكار ومشروعات منزلية فردية وأسرية وجماعية. تأسيساً على كل هذا تقوم هذه الوحدة بتقديم التوجيه والإرشاد اللازم حول الكيفية التي يجب التعامل من خلالها عند الدخول في ساحة العمل التجاري من بوابة المشروعات الصغيرة أو المنزلية</li>
              <li>التدريب الذي يقود للحصول على مؤهل مهني في المجالات المتخصصة كالمحاسبة والتدقيق المالي والتخصصات المرتبطة بالجوانب التقنية كالدعم الفني وصيانة الأجهزة والمعدات والشبكات ومهارات إدارة المكاتب ومهارات التسويق الإلكتروني والأمن السبراني ... إلخ . </li>
              <li>الاتجاه نحو تدريب الصغار وذلك في كل ما يرتبط بموضوعات التراث وثقافة المجتمع مثل : أسس الضيافة العربية - التعامل مع البيئة البرية - التعامل مع البيئة البحرية - الألعاب القديمة ... إلخ</li>
            </ul>
          </div>

          <div className='mt-5 '>
            <h2 className='text-2xl font-bold mb-5 text-yellow-700 ml-5'>في إطار الاستشارات .</h2>

             <div className="flex justify-center items-center -mt-10">
            <img src={Nuser}
              className="h-auto object-cover
               max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl" alt="Nursery" />
          </div>

            <ul className='list-disc list-inside space-y-4 text-lg '>
              <li> أما فيما يتعلق في مجال الاستشارات فالرؤية الاستراتيجية تتجه ضمن التالي: </li>
              <li>مركز التدخل المبكر وهو مركز متخصص يقوم بتقديم الاستشارات والدعم والتأهيل للاحتياجات الخاصة ومن في حكمهم. حيث تم و تجهيز عيادة وجهاز فني متخصص لهذا الغرض</li>
              <li>الدعم الاسري وذلك بغرض التعامل مع كل ما يتعلق في منظومة العلاقات الأسرية وتربية الأبناء بناء والتعامل مع سلوكيات المراهقين وأنماط شخصياتهم ... إلخ</li>
              <li>استشارات مهارات القيادة وإدارة الأعمال وما يرتبط فيها من مهارات ومعارف وقيم تساعد المبادر أو رجل الأعمال على تحسين مشروعاته وأعماله. </li>
              <li> استشارات تتعلق في مجالات العمل المختلفة مثل: الاستثمار في البورصة - الذهب - العملات - دراسات الجدوى - دراسات الإدارة المختلفة وما يرتبط فيها من فروع ... إلخ</li>
            </ul>
            <h2 className='text-2xl font-bold mb-5 text-yellow-700 ml-5 mt-10'>في إطار التعليم‎</h2>
          </div>

          <div>
            <h2 className='text-xl font-bold text-yellow-700 mb-3'>الرخصة الدولية .</h2>
            <ul className='list-disc list-inside text-lg space-y-4'>
              <li> وهي حزمة من البرامج التعليمية المعدة بإتقان والتي يتمحور تركيزها على رفع مهارة وكفاءة المعلمات المتخصصات في تدريس الحضانات سيتم رسم خطة تدريبية شاملة تتضمن تلك البرامج بحيث يتم تسويقها على معلمات الحضانات رياض الأطفال ومن في مستواهم.</li>
              <h2 className='text-xl font-bold text-yellow-700 mb-3'>الاعداد النفسي والتربوي للمربيات (المعلمات) . </h2>
              <li>وهي سلسلة ورش عمل تنفيذية وحلقات نقاش تتعلق بالتحديات التي تواجه المعلمات وتقديم حلول عملية من خلال تجارب ناجحة وأبحاث علمية حديثة نتج عن هذا الجهد الثقافي كتاب يحمل هذا الاسم. وسيتم تحويل محتواه إلى سلسلة ورش عمل وندوات تربوية يستفيد منها العاملين في المجال التربوي سواء في الحضانات أو رياض الأطفال</li>
            </ul>
          </div>

          <div className='mt-10'>
            <h2 className='text-xl font-bold text-yellow-700 mb-3'>في إطار العلاقات الخارجية</h2>

            <ul className='list-disc list-inside text-lg space-y-4'>
              <li>تكوين شبكة من العلاقات مع المؤسسات المثيلة ( على المستوى الداخلي والخارجي وذلك ضمن الإطار التالي: اعتماد نظام التعاون ضمن صيغة اتفاقية تعاون - برتوكول تعاون - مذكرة تفاهم) أو أية صيغة قانونية يرتضيها طرفي العمل. </li>
              <li>على المستوى الداخلي (المحلي) ويتمثل هذا التعاون مع المؤسسات العاملة في مجال الحضانات - التدريب - الاستشارات. لعل عملية دراسة وحصر المؤسسات المثيلة والعاملة في الميدان في المجالات السابقة تكون هي المنطلق الذي ينبني عليه التعاون.
                سواء كان مشروع مشترك يأخذ شكل الاحتفالية الجماهيرية) أو (مشروع تبادل الخبرة أو مشروع تدريبي) أو مشروع تقديم خدمة استشارات تربوية واجتماعية وفنية وإدارية.. الخ). أو مشروع جديد يتصف بالإبداع والابتكار ويقدم خدمة جديدة تقتصر على طرفي التعاون</li>
              <li>. استحداث منصة الكويت الثقافية (KCP Kuwait Cultural Platform) تعمل على نشر الثقافة في جميع مجالات الحياة دون استثناء. تعمل هذه المنصة على أساس الحضور الشخصي إلى مكان اللقاء وفي نفس الوقت تقوم ببث برامجها عن بعد. حيث يقوم المتحدث بتقديم تجربته الثقافية أو دراسته التي قام بها أو كتابه الذي قام بتأليفه. بحث لا يتعدى التقديم من 15 إلى 20 دقيقة كحد أعلى. </li>
              <li>على المستوى الخارجي: بنفس النسق ومنهجية التعاون الداخلي (المحلي) يسير التعاون الخارجي. مع التركيز على تبادل التجارب وتقديم خدمة نقل التجربة وتدريب الكوادر العاملة في مجال الحضانات وذلك باعتبار امتلاك برنامج الرخصة الدولية وكذلك</li>
            </ul>

          </div>


          {/* perp */}
          <div>

            <h2 className='text-4xl text-center mt-10  font-bold  mb-3'>الرؤية المؤسسية لبريب</h2>
            <span className='bg-yellow-500 w-20 h-1 rounded-full block mt-4 mb-15 mx-auto '></span>

            <div className="flex justify-center items-center mt-10">
              <img src={Perp}
                className="h-auto object-cover
               max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl" alt="Nursery" />
            </div>

            <ul className='list-disc list-inside text-lg space-y-4'>
              <li>الانتشار والتوسع الجغرافي وذلك للوصول إلى أكبر شريحة ممكنة من العملاء:</li>
              <li> وهذا يقتضي دراسة موقع الكثافة التشغيلية للمشروع والعمل على تمديد مواقع العمل ليشمل مواقع أخرى، واضعين في الاعتبار وجود منافسة متنامية على شريحة من السكان أصحاب الاهتمام في مثل هذه الخدمات.</li>
              <li> :التنوع في الخدمات وذلك على مستوى الوجبات المقدمة وكذلك نظام الاشتراك وطرق السداد وقيمة الاشتراك التنافسية. لعل من أهم أدوات توسعة الحصة السوقية ومواجهة المنافسة بحلول استراتيجية وتكتيك مدروس يرتكز على الآتي</li>
              <li>توسعة خيارات العميل من خلال تعدد أنواع الطعام (قائمة طعام متنوعة وثرية) - تصنيف نظام الاشتراك وتقسيمه إلى فئات مجوهراتيه الألماسية الذهبية الفضية العاجية البرونزية بحيث يتم إعطاء كل فئة عدد من المميزات أكثر ممن قبلها. تحديد أسعار اشتراكات كل فئة من الفئات السابقة بشكل يجعل العميل يتجه للفئة الأعلى وذلك باعتبار فروق التكلفة الطفيفة. </li>
              <li> الدخول في مجال تقديم البوفيهات الصحية في الحفلات والمناسبات المختلفة. </li>
              <li>الانضباط والدقة في تسليم الوجبة إلى العميل وذلك باعتبار أن موعد تناول الوجبة من العناصر المهمة بالنسبة للعميل وارتباط ذلك بالنظام الغذائي.</li>
              <li>. الاستمرار ضمن المراكز الأولى لمؤسسات الغذاء الصحي وذلك من خلال الحصول على الاعتمادات المهنية المتوفرة: الاعتماد المهني والتصنيف جمعية المحاسبين والمراجعين الكويتية) - الآيزو هيئة المقاييس الدولية - هيئة التقييس لدول مجلس التعاون لدول الخليج العربي - منظمة الفاو التابعة للأمم المتحدة وهي جهة دولية لا تصدر شهادات اعتماد دولية لكنها تصدر تعليمات حول سلامة الغذاء باعتبار التخصص - المنظمة العربية للصناعة والتعدين تعمل على تعزيز التنمية الصناعية في الدول العربية، وقد تشمل أنشطتها جوانب تتعلق بسلامة الأغذية في المطاعم.</li>
              <li> .ملاحظة: الاعتماد المهني للمطاعم غالبًا ما يتم من خلال جهات تقييم محلية أو إقليمية معتمدة، وليس بالضرورة من خلال منظمات دولية. هذه الجهات المحلية قد تتبع معايير دولية أو تضع معايير خاصة بها بناءً على متطلبات السوق المحلية</li>
              <li> عقد صفقات تبادلية داخل الكويت وخارجها مع المؤسسات العاملة في مجال الأغذية وما يرتبط فيها من أعمال ومشروعات</li>
              <li>العمل على الاتفاق بالباطن مع شركات التزويد الغذائي </li>
              <li>تسويق خدمات المطبخ المركزي واستعداده لتجهيز الوجبات المطلوبة لطالبي الخدمة. </li>
              <li> العمل على قيام شراكات تعاونية داخل الكويت وخارجها في مجال الغذاء ونقل الخبرة.</li>
              <li>محاولة التركيز على عقود التجهيزات الغذائية للمؤسسات الرسمية والخاصة والأهلية والخيرية والمجتمعية بشكل عام. </li>
              <li>التعاون المشترك مع ناشطي وسائل التواصل الاجتماعي والمهتمين في مجال الصحة والغذاء وذلك في مجال التسويق والترويج</li>
              <li>السعي للحصول على وكالات مرتبطة في جوانب الصحة والغذاء المكملات الغذائية وبرامج التخسيس والتدريب والأواني المنزلية (مثال: حافظات الأغذية وحاويات الحرارة والبرودة .... إلخ). </li>
              <li> التميز في طرق تقديم الوجبات من حيث نوعية وفخامة التغليف والتعليب التركيز على الخدمة المساندة واحدة من الأدوات الفاعلة في مواجهة المنافسة والتعامل معها. بطبيعة الحال الوجبة الصحية هي النواة الأساسية في مشاريع الغذاء)، لكن تدور حول تلك النواة مجموعة من الخدمات التي ترفع أو تخفض تلك النواة والتي هي الوجبة بحد ذاتها. ويأتي على رأس تلك الخدمات المساندة خدمة التغليف والتعليب). وهي الخدمة التي تسعى إلى الاشباع البصري للعميل. فكلما كان التغليف والتعليب مبتكرا وجذابا كان أثر ذلك مباشرا على إقبال العملاء على المنتج الغذائي. </li>
              <li>. تنمية الإيرادات السنوية موزعة كالتالي: مشروع صندوق الغذاء الصحي ، طلبات منصات الطعام المتعددة ، مشروع البوفيه الصحي ، مشروع المنتج الجديد ( مالح أو حالي أو محمد ) ، مشروع منافذ البيع الجديدة </li>
            </ul>
          </div>


        </div>

      </div>
    </>
  );
};

export default OurVision;
